import React from "react";
import "../../styles/webStyle/Content.css";
import CsharpImage from "../../images/CSharpCode.jpg";

function Content() {
  return (
    <div id="content">
      <p id="text">
        C#‎ (נהוג לבטא C Sharp או "סִי שַׁארפּ") היא שפת תכנות עילית
        מרובת-פרדיגמות, מונחית עצמים בעיקרה, המשלבת רעיונות כמו טיפוסיות חזקה,
        אימפרטיביות, הצהרתיות, פונקציונליות, פרוצדורליות וגנריות. השפה פותחה על
        ידי "מיקרוסופט" בשנת 2000 כחלק מפרויקט דוט נט ותוקננה בשנים 2005 ו-2006
        על ידי ארגון התקינה Ecma כתקן ECMA-334 ועל ידי ארגון התקינה הבין-לאומי
        כתקן ISO/IEC 23270:2006.
        <img src={CsharpImage} />
        לאחר הפסדה של "מיקרוסופט" במשפט לחברת "סאן", בעקבות סכסוך שפרץ ביניהן
        סביב המימוש של "מיקרוסופט" לשפת ג'אווה, שנקרא J++‎, חויבה "מיקרוסופט" על
        פי פסק הדין להפסיק לשווק את J++‎ וכן את המכונה הווירטואלית שפיתחה עבורה,
        MS-JVM. עקב כך הוחלט ב"מיקרוסופט" על פיתוח שפה חדשה במטרה להוות תחליף
        ראוי לשפות התכנות מהדור הקודם כמו ויז'ואל בייסיק או C++‎ וכן להוות יריב
        שקול לג'אווה. צוות פיתוח בראשות מהנדס התוכנה הדני אנדרס הלסברג (מי
        שהמציא את טורבו פסקל והיה מאדריכלי דלפי) הופקד על פיתוחה בתחילת 1999,
        והגרסה הראשונה הושקה עם ההכרזה על דוט נט ביולי 2000[1]. גרסה זו סיפקה את
        התשתית הראשונית לכתיבת יישומים שולחניים ואתרי אינטרנט, תוך שהיא שואבת
        הרבה מממשק תכנות יישומים והתחביר של ג'אווה, גם בטכנולוגיית פיתוח האתרים,
        ASP.NET.
      </p>
    </div>
  );
}

export default Content;
